{
    // JSON objects are surrounded by curly braces {}.
  
    // Data in JSON is written as key/value pairs. Keys are strings, and values can be several different types (string, number, object, array, boolean or null).
    // Here "name" is the key, and "John Doe" is the value. Both are strings, so they're enclosed in double quotes.
    "name": "John Doe",
  
    // Here's another key/value pair. "tagline" is the key, and the sentence that follows is the value.
    "tagline": "Experienced software engineer with a passion for coding.",
  
    // The email address of the person is stored as a string.
    "email": "john.doe@example.com",
  
    // Similarly, the phone number is stored as a string.
    "phone": "123-456-7890",
  
    // The address is also stored as a string.
    "address": "123 Main St, Anytown, USA",
  
    // The value of "socialLinks" is an object, so it's enclosed in curly braces.
    "socialLinks": {
      // Inside this object, we have three more key/value pairs. The keys are the names of the social platforms, and the values are the corresponding URLs.
      "linkedin": "https://www.linkedin.com/in/johndoe",
      "twitter": "https://twitter.com/johndoe",
      "github": "https://github.com/johndoe"
    },
  
    // "objective" is another simple key/value pair.
    "objective": "To contribute to the success of a forward-thinking company with my skills and experience as a software engineer.",
  
    // The value of "education" is an array, so it's enclosed in square brackets []. Each item in the array is an object, representing one degree the person has earned.
    "education": [
      {
        // Each degree object has three key/value pairs: "degree", "institution", and "years".
        "degree": "B.S. in Computer Science",
        "institution": "University of Example",
        "years": "2010-2014"
      }
    ],
  
    // The "experience" key also has an array as its value. Each item in the array is an object, representing one job the person has held.
    "experience": [
      {
        // Each job object has three key/value pairs: "jobTitle", "company", and "years".
        "jobTitle": "Senior Software Engineer",
        "company": "Example Company",
        "years": "2014-Present"
      }
    ],
  
    // The value of "skills" is an array of strings. Each string represents one skill the person has.
    "skills": ["Python", "JavaScript", "C++", "HTML", "CSS", "SQL", "Git"]
  }
  